#!/usr/bin/python3.x
# -*- coding=utf-8 -*-
"""
 Time       : 2021/8/23 9:35
 Author     : hike
 Email      : hikehaidong@gmail.com
 File Name  : 表情过滤.py
 Description:
 Software   : PyCharm
"""
st1="""
(5718467559960349696, 11, '并且都能送到楼上,寄大件儿合适,另外超过', '并且都能送到楼上,寄大件儿合适,另外超过30公斤他们有重货服务,越重越便宜3、\n优速\n、白鸽也挺便宜的4、货拉拉有等候费,一小时内免费,一小时后每分钟0.7元的5、省内件以及不超过首重的省外件,丰巢方便又便宜6、顺丰寄大件其实很便宜...走', '<pre style="white-space: pre-wrap;white-space: -moz-pre-wrap;white-space: -pre-wrap;white-space: -o-pre-wrap; word-wrap: break-word;"><zhengwen>整理了一些寄快递的Tips\n\n一、国内：\n1⃣寄小件：\n1、菜鸟裹裹商家版\n2、申通、中通、圆通、百世汇通、韵达等\n\n2⃣寄大件：\n1、中国邮政贴邮票（不是EMS，邮票自己买）\n2、中铁快运（30公里免运费，超过30公里按里程数物品的体积和重量来收费）\n3、货拉拉（每公斤3毛3，在家下单，快递员来揽收）\n4、德邦和顺丰、京东\n\n3⃣其他：\n1、轻的走快递，重的走物流\n2、南方寄北方：圆通\n3、北方寄南方：中通\n4、广东寄东北：申通\n5、文件、发票、合同类：顺丰、EMS\n6、偏远：中国邮政\n7、冷链生鲜：顺丰、京东\n8、到付选顺丰\n9、某宝咸鱼可以代发或者买优惠券\n\n4⃣评论补充：\n1、安能：来回跨省搬家我都用的安能，那么多东西就一百多\n2、京东和顺丰跨省续费比通达系便宜，并且都能送到楼上，寄大件儿合适，另外超过30公斤他们有重货服务，越重越便宜\n3、<font color="red">优速</font>、白鸽也挺便宜的\n4、货拉拉有等候费，一小时内免费，一小时后每分钟0.7元的\n5、省内件以及不超过首重的省外件，丰巢方便又便宜\n6、顺丰寄大件其实很便宜...走特殊的结算方式。本顺丰员工发言\n7、补一个冷知识：北京河北之间互寄用顺丰，想象不到得快和便宜。\n8、重要证件能选顺丰就不要EMS（根据自己实际情况选择）\n9、江浙沪寄安徽的件，圆通，中通，申通，快过顺丰（只要能赶上当晚最后一班货发出前交出去，顺丰还是比较快）\n10、江浙沪的大件就别用中铁快运了，官网很难用物流信息也很难查，比韵达申通还贵。\n11、不知道有没有人能看到，新疆的姐妹，用德邦物流寄重物38公斤宁波到乌鲁木齐110\n\n二、国外：\n分别是顺丰、DHL、EMS和小包快跑\n\n从费用、限制、时效做了一下对比\ud83d\udc47\n1⃣、DHL\n1、下单：小程序下单\n2、价格：最贵，寄美国0.5kg起，不满0.5kg按0.5kg计费，最低463元，2天后才能来揽货的价！\n3、限制：限制多，不能寄食品、药品等\n4、时效：最快，一般3-7天到门\n\n总结：适合寄送些比较急的重要物件\n\n2⃣、顺丰国际：\n1、下单：小程序下单\n2、价格：中等，寄美国0.5kg起，最低205元，2小时上门\n3、限制：很严，食品、药品、化妆品、带电池类产品都不能寄\n4、时效：也算比较快的了，稍慢于DHL，7天内都能到门\n\n总结：要求便宜一点稍微快点就可以选择他们家。\n\n3⃣、EMS：\n1、下单：有小程序下单，2小时可以上门\n2、价格：相对DHL要便宜，最低240元起\n3、限制：较松，食品啊、药品啊、化妆品啊什么的大部分可以寄。\n4、时效：这个就不好说了，时效有点慢，一般都要在15天以上了\n（评论补充：EMS国际最便宜98，不是240，享受绿色清关，生活用品基本都可以寄，疫情前发日本最快三天就到了）\n\n总结：想寄吃的、药品、化妆品选择他家。\n\n4⃣、小包快跑国际寄件\n1、下单：微信上搜小包快跑国际寄件，就可以找到，下单流程和前面几家差不多，觉得下单繁琐，可以找他们的客服下单，客服态度非常好。客服推荐自寄到仓，总价便宜就好，羊毛出在羊身上。\n2、价格：最便宜的一个，选择也比较多，有代理DHL、UPS、FEdex和EMS，价格是官方的3-5折，1g都可以寄，0.5kg76元就能到门，太划算了。\n3、限制：很松，食品、药品、化妆品都可以寄，只要不是白色，粉末类的产品也可以寄，非一线大牌，二三线品牌也能寄。\n4、时效：食品类走的邮政特殊通道时效一样，非食物类产品5-8个工作日到门。\n\n总结：撇开品牌知名度来说，性价比最高，食品、药品、化妆品想寄的都能寄，时效不火急火燎的用他们家很合适，想用DHL、UPS，愿意多花个2天时间，能省一大把钱。\n\n5⃣评论补充：\n1、DHL可以个人寄件，需要携带身份证或者护照原件，费用高是真的，时效不能说死，但是来寄件的客户说挺快的，公司合作的话会便宜，这个都是跟销售商量（DHL工作人员分享）\n2、DHL食品药品化妆品这些，根据各个国家要求不同有些可以有些不可以，也不寄国内件，只走国际，疫情期间顺丰ems都寄不出去，只有DHL可以走，防疫物资真的寄爆仓（DHL工作人员分享）\n3、小包快跑寄欧洲的还是比较贵的，推荐渥途物流（按物品收税，运费超低）、易欧拼（欧盟境内30元/kg，15kg起寄）铁路运输，一般一个多月这样，可以去查查看\n4、DHL公司注册账号，可以打6折\n5、DHL的三到七天（一个月）请牢记\n6、寄国外快递的时候收件人要留意自己的电子邮箱和实体邮箱\n\n（仅供参考！！）</zhengwen></pre>', 'http://weibo.com/7529865712/KuqDCjXYk', '奋斗7529865712', '2021-08-21 06:46', 1, '河南', 0.9)
"""

st1="""
(5718489581080089600, 11, '喝完酒的第二天 有人买好粥🥣和玉米🌽油条', '喝完酒的第二天 有人买好粥🥣和玉米🌽油条也太幸福了\nhttp://t.cn/RGBn1R4\n\u200b\u200b ORNI 国油条 钻 公 6 Cp\n优速\n大小 CeBeaO JIANG CHUAN', '<pre style="white-space: pre-wrap;white-space: -moz-pre-wrap;white-space: -pre-wrap;white-space: -o-pre-wrap; word-wrap: break-word;"><zhengwen>喝完酒的第二天 有人买好粥\ud83e\udd63和玉米油条也太幸福了<img src = "//img.t.sinajs.cn/t4/appstyle/expression/ext/normal/14/moren_awsl02_org.png"/  style="width: 18px;height: 18px;">   \u200b\u200bORNI 国油条 钻 公 6 Cp 优速大小 CeBeaO JIANG CHUAN</zhengwen></pre>', 'http://weibo.com/5773857718/KusgKnO2U', '小鱼干冲上岸', '2021-08-21 10:56', 1, '贵州', 0.9)
"""

st2="""
(5718494661388618752, 11, "以有lg/❤:@🌺婷婷🍀很乖 😘(O1233354969) @温柔宏 /🎱(O1056970499) @我们散开吧!(O1663851080) @汤利🐸(O909028664) @黑白呢.......(O1439228824) @好想打阔睡(O2030413174) @苏冉⊙∀⊙!(O1250956323) @❤️乖乖女$珍宝❤️(O2433072046) @小可可爱❤️❤️❤️❤️(O1151763270) @阿燕(互粉)(O2296597437) @❤熊和兔(O1107485951) @不如放弃✨(O2416618973) @可爱宝宝0026(O2481201559) @卡丁车(O2362036833) @💞琳妹💞(O2283113451) @非正常人!(O2350172214) @閃友的酒(O1020071942) @卑微的小学(O1679105667) @文庭(O2207423839) @烟起雾散(冲1000)(O2064821100) @奶泡星球.com🤗(O1811179098) @倩💓豆💓豆(O1468588301) @ᝰꫛꫀꪝ言52o1⁄31⁄4🕊(O1080037300) @🕊️抑郁~女孩💔(O1590924264) @~依旧✔张无道卍(O546350713) @月野_🍒兔(O1278165188) @济宁農村人我(O1278408075) @阿。🌴·伟(O1278487390) @算明💕(O1908720897) @❤苗族🍃阿平✨(O1985470472) @镇海\n优速\n物流(O800166092) @T_TGG(O2439891110) @香(O2467894391) @深情续以晚霞ʚɞ(O1753525562) @徐..🀄平..🎱(O2388858086) @悠悠🍀安静🌈(O1309186174) @家有公主(倚后)(O1215999789) @1⃣琴.....(O2205243374) @苏皖洛(O2212064203) @阿 ―总(O1266272518) @苗族男孩一一🙈DJ乖乖(O1798859525) @💕对霞的温柔💕(O2391769117) @胜华✨☀️学长(O1449753675) @云南:TM(O1739573051) @爱这❌苗家人⭕🅰(O2413052798) @Maked(O2258964441) @對你,何止1.句喜歡!(O1339782654) @和平精英---多多(O1772427448) @港島日人覺(O1278253601) @佛袖~(O1278162058) @朝阳c.(O1278420597) @💕洗美不爱💕(O1793062526) @没人爱的渣男只有游戏爱(O2115493150) @❤️宠🌺陆🌸风❤️(O2282753145) @我要乖1⃣️点啦❤️(O1790077190) @赵兴林(O1881161377) @伊伊宝❤️🕊(O1338275118) @《嫉妒💔》俊(O1454001122) @Thea(O2372420196) @我不搞伤感💞只搞精神(O2446708812) @帅哥 😜😜(O2190380476) @依依💔💔(O2402238056) @语轩🍎(O2364752869) @qr一🍃🍃🍃🍃(O2374040274) @风淡云轻(O2452202882) @“最后的深情”(O2204156653) @暗示.👻(O2205292421) @如直接(O2421645421) @颜心心(O2466144200) @🍒苗族🍒咪哆蒙🍒(O2389142585) @✺(^O^)✺小米🍀(O573762769) @仙衣-和平精英(O304397196) @YANG.春麗(O2323521055) @梅宝🌺🌺(O1981246735) @小珍珠二宝(O1278129484) @-Saku☃rakoˇ(O2293744346) @txy💞(O2003543544) @☞莫问归期冲3000(O1429208899) @🌴橙汁🌴(O2353949954) @错~季 *(O636496059) @小李与小唐(O1098895934) @请叫我夕阳OK(O214@陪江哥长大(O1953247678) @张春成,,(O1064454048) @遥遥江上客💞(O2090360388) @❀瞅.(O2434822172) @一笑吖ღ ͜✿҉(O107604674) @卿......🌊(O2442145722) @一路精神(O2238181564) @爱56453(O1637864027) @ლ—(°◡°)-ლ😁(O1998262508) @小段......加油(●'◡'●)(O2445708482)", '伟(O1278487390) @算明💕(O1908720897) @❤苗族🍃阿平✨(O1985470472) @镇海\n优速\n物流(O800166092) @T_TGG(O2439891110) @香(O2467894391) @深情续以晚霞', '<pre style="white-space: pre-wrap;white-space: -moz-pre-wrap;white-space: -pre-wrap;white-space: -o-pre-wrap; word-wrap: break-word;"><zhengwen>@婷婷很乖 (O1233354969) @温柔宏 /(O1056970499) @我们散开吧！(O1663851080) @汤利(O909028664) @黑白呢.......(O1439228824) @好想打阔睡(O2030413174) @苏冉⊙∀⊙！(O1250956323) @❤️乖乖女$珍宝❤️(O2433072046) @小可可爱❤️❤️❤️❤️(O1151763270) @阿燕（互粉）(O2296597437) @❤熊和兔(O1107485951) @不如放弃✨(O2416618973) @可爱宝宝0026(O2481201559) @卡丁车(O2362036833) @琳妹(O2283113451) @非正常人！(O2350172214) @閃友的酒(O1020071942) @卑微的小学(O1679105667) @文庭(O2207423839) @烟起雾散（冲1000）(O2064821100) @奶泡星球.com\ud83e\udd17(O1811179098) @倩豆豆(O1468588301) @ᝰꫛꫀꪝ言⁵²º⅓¼(O1080037300) @️抑郁～女孩(O1590924264) @～依旧✔张无道卍(O546350713)  @月野︴兔(O1278165188)  @济宁農村人我(O1278408075) @阿。·伟(O1278487390) @算明(O1908720897) @❤苗族阿平✨(O1985470472) @镇海<font color="red">优速</font>物流(O800166092) @T_TGG(O2439891110) @香(O2467894391) @深情续以晚霞ʚɞ(O1753525562) @徐..\ud83c\udc04平..(O2388858086) @悠悠安静(O1309186174) @家有公主（倚后）(O1215999789) @1⃣琴.....(O2205243374) @苏皖洛(O2212064203) @阿 ―总(O1266272518) @苗族男孩一一DJ乖乖(O1798859525)  @对霞的温柔(O2391769117) @胜华✨☀️学长(O1449753675) @云南:™(O1739573051) @爱这❌苗家人⭕\ud83c\udd70(O2413052798) @Maked(O2258964441) @對你,何止1.句喜歡！(O1339782654) @和平精英---多多(O1772427448) @港島日人覺(O1278253601) @佛袖~(O1278162058) @朝阳c.(O1278420597) @洗美不爱(O1793062526) @没人爱的渣男只有游戏爱(O2115493150) @❤️宠陆风❤️(O2282753145) @我要乖1⃣️点啦❤️(O1790077190) @赵兴林(O1881161377) @伊伊宝❤️(O1338275118) @《嫉妒》俊(O1454001122) @Thea(O2372420196) @我不搞伤感只搞精神(O2446708812) @帅哥 (O2190380476) @依依(O2402238056) @语轩(O2364752869) @qr一(O2374040274) @风淡云轻(O2452202882) @“最后的深情”(O2204156653)  @暗示.(O2205292421) @如直接(O2421645421) @颜心心(O2466144200) @苗族咪哆蒙(O2389142585) @✺（^O^）✺小米(O573762769) @仙衣-和平精英(O304397196) @YANG.春麗(O2323521055) @梅宝(O1981246735) @小珍珠二宝(O1278129484) @-Saku☃rakoˇ(O2293744346) @txy(O2003543544) @☞莫问归期冲3000(O1429208899) @橙汁(O2353949954) @错~季 *(O636496059) @小李与小唐(O1098895934) @请叫我夕阳OK(O214@陪江哥长大(O1953247678) @张春成，，(O1064454048) @遥遥江上客(O2090360388) @❀瞅.(O2434822172) @一笑吖ღ ͜✿҉(O107604674) @卿……(O2442145722) @一路精神(O2238181564) @爱56453(O1637864027) @ლ—（°◡°）-ლ(O1998262508) @小段……加油（●＇◡＇●）(O2445708482)</zhengwen></pre>', 'https://live.kuaishou.com/u/3xmmm4fkyqs6766/3xdhd8fcph63frq', '以有lg/❤', '2021-08-21 16:24', 2, '北京', 0.9)
"""

import re



# 方法一
def remove_emoji(text):
    emoji_pattern = re.compile(
        u"(\ud83d[\ude00-\ude4f])|"  # emoticons
        u"(\ud83c[\udf00-\uffff])|"  # symbols & pictographs (1 of 2)
        u"(\ud83d[\u0000-\uddff])|"  # symbols & pictographs (2 of 2)
        u"(\ud83d[\ude80-\udeff])|"  # transport & map symbols
        u"(\ud83c[\udde0-\uddff])"  # flags (iOS)
        "+", flags=re.UNICODE)
    return emoji_pattern.sub(r'', text)

# 方法二
def filter_emoji(desstr, restr=''):
    # 过滤表情
    res = re.compile(u'[\U00010000-\U0010ffff\uD800-\uDBFF\uDC00-\uDFFF]')
    return res.sub(restr, desstr)


# 方法三  这种方法简单粗暴，直接把非中英文及数字的所有字符串删除
def filter_str(desstr, restr=''):
    # 过滤除中英文及数字以外的其他字符
    res = re.compile("[^\u4e00-\u9fa5^a-z^A-Z^0-9]")
    return res.sub(restr, desstr)
# # \ud83d\udc47\
# import emoji
# result=emoji.demojize(st1)
# # print(result)
# print(emoji.emojize(result))

# print(remove_emoji(st1))
print(filter_emoji(st2))


# print(filter_str(st1))
